Repository: KDE/massif-visualizer
Catalog: po/*/massif-visualizer.po
Languages: eu

# NAME OF TRANSLATORS
source: Your names
eu: Iñigo Salvador Azurmendi

# EMAIL OF TRANSLATORS
source: Your emails
eu: xalba@ni.eus

# @action
source: Focus Most Expensive Node
eu: Harreta korapilune garestienera

source: CallGraph Toolbar
eu: «CallGraph» Tresna-barra

# @action
source: Toggle Total Cost Graph
eu: Txandakatu kostu osoaren grafikoa

# @action
source: Toggle Detailed Cost Graph
eu: Txandakatu kostu xehatuaren grafikoa

source: Stacked diagrams
eu: Pilatutako diagramak

# @label:spinbox
source: Stacked diagrams:
eu: Pilatutako diagramak:

# @action
source: Hide Function
eu: Ezkutatu funtzioa

# @action
source: Hide Other Functions
eu: Ezkutatu beste funtzio batzuk

source: time in %1
eu: denbora %1(e)tan

source: memory heap size
eu: memoria dinamikorako neurria

source: Memory consumption of %1
eu: %1(e)ren memoria erabilera

source: Peak of %1 at snapshot #%2
eu: %1(e)ko gailurra #%2 uneko argazkian

source: Command: %1 Valgrind Options: %2
eu: Komandoa: %1 «Valgind»en aukerak: %2

# @title:window
source: Save Current Visualization
eu: Gorde uneko irudikapena

source: Images (*.png *.jpg *.tiff *.svg)
eu: Irudiak (*.png *.jpg *.tiff *.svg)

source: Failed to save the image to %1.
eu: Irudia %1(e)an gordetzea huts egin du.

# @title:window
source: Massif Chart Print Preview
eu: «Massif» diagrama inprimatzeko aurreikuspegia

source: Chart Toolbar
eu: Diagrama Tresna-barra

source: Cost Precision:
eu: Kostuen zehaztasuna:

source: Shorten Templates:
eu: Laburtu txantiloiak:

source: Legend
eu: Legenda

source: Position:
eu: Kokapena:

source: North
eu: Iparraldea

source: East
eu: Ekialdea

source: South
eu: Hegoaldea

source: West
eu: Mendebaldea

source: Floating
eu: Higikorra

source: Alignment:
eu: Lerrokatzea:

source: Left
eu: Ezkerrean

source: Center
eu: Erdian

source: Right
eu: Eskuinean

source: Top
eu: Goian

source: Bottom
eu: Behean

source: Font Size:
eu: Letra-neurria:

# @title:tab
source: Settings
eu: Ezarpenak

# @info:status
source: Loading file <filename>%1</filename>…
eu: <filename>%1</filename> fitxategia zamatzen…

# @title:tab
source: Memory Chart
eu: Memoriaren diagrama

# @title:tab
source: Callgraph
eu: Deien grafikoa

# @title:tab
source: Allocators
eu: Esleitzaileak

source: A visualizer for output generated by Valgrind's massif tool.
eu: «Valgrind»en «massif» tresnak sortutako irteerakoaren irudikapen bat.

source: Original author, maintainer
eu: Jatorrizko egilea eta mantentzailea

source: Multiple document interface, bug fixes
eu: Dokumentu anizkoitzeko interfazea, akats zuzenketak

source: Files to load
eu: Zamatu beharreko fitxategiak

source: [FILE...]
eu: [FITXATEGIA…]

# @action
source: Shorten Templates
eu: Laburtu txantiloiak

# @action
source: Select Peak Snapshot
eu: Hautatu gailurraren uneko argazkia

# @action
source: Add
eu: Gehitu

# @info:tooltip
source: Add custom allocator
eu: Gehitu neurrira ipinitako esleitzailea

# @action
source: Remove
eu: Kendu

# @info:tooltip
source: Remove selected allocator
eu: Kendu hautatutako esleitzailea

# @action
source: Mark as Custom Allocator
eu: Markatu neurrira ipinitako esleitzaile gisa

# @action:button
source: Open Massif Data File
eu: Ireki «Massif» datu-fitxategia

# @title:window
source: Open Massif Output File
eu: Ireki «Massif» irteerako fitxategia

source: Massif data files (massif.out.*)
eu: «Massif» datu fitxategiak (massif.out.*)

# @title:window
source: Add Custom Allocator
eu: Gehitu neurrira ipinitako esleitzailea

# @label:textbox
source: Allocator:
eu: Esleitzailea:

# @title:window
source: Evaluation of %1 (%2)
eu: %1(e)ren ebaluazioa (%2)

source: Massif Data
eu: «Massif» datuak

source: filter
eu: iragazkia

source: Custom Allocators
eu: Neurrira ipinitako esleitzaileak

source: Cost Precision
eu: Kostuen zehaztasuna

source: Defines the number of places after the comma for memory costs shown in the application.
eu: Aplikazioan erakutsitako memoria-kostuetan, koma ondoko leku-kopurua definitzen du.

source: Shorten Templates
eu: Laburtu txantiloiak

source: Defines whether identifiers of C++ template instantiations should be shortened by removing their template arguments.
eu: C++ txantiloi instantzien identifikatzaileak, haien txantiloi argumentuak kenduz laburtu behar diren edo ez definitzen du.

source: Legend Position
eu: Legendaren kokapena

source: Defines the position of the legend relative to the plot.
eu: Legendaren kokapena trazuarekiko erlatibo definitzen du.

source: Legend Alignment
eu: Legendaren lerrokadura

source: Defines the alignment of the legend.
eu: Legendaren lerrokadura definitzen du.

source: Legend Font Size
eu: Legendaren letraren neurria

source: Defines the font size used in the legend.
eu: Legendan erabilitako letraren neurria definitzen du.

source: &File
eu: &Fitxategia

source: &View
eu: &Ikuspegia

source: &Settings
eu: E&zarpenak

source: &Dock Widgets
eu: Trepetak atra&katu

source: &Help
eu: &Laguntza

source: Main Toolbar
eu: Tresna-barra nagusia

source: Download Failed
eu: Zama-jaistea huts egin du

source: Failed to download remote massif data file <i>%1</i>.
eu: Urrutiko <i>%1</i> «massif» datu fitxategia zama-jaistea huts egin du.

source: Read Failed
eu: Irakurtzea huts egin du

source: Could not open file <i>%1</i> for reading.
eu: Ezin izan du <i>%1</i> fitxategia irakurtzeko ireki.

source: Parser Failed
eu: Analizatzaile sintaktikoak huts egin du

source: Could not parse file <i>%1</i>.<br>Parse error in line %2:<br>%3
eu: Ezin izan du <i>%1</i> fitxategiaren azterketa sintaktikoa egin.<br>Errore sintaktikoa %2 lerroan:<br>%3

source: Empty Data File
eu: Datu fitxategia hutsik

source: Empty data file <i>%1</i>.
eu: Datu fitxategia hutsik <i>%1</i>

source: <dt>function:</dt><dd>%1</dd>
eu: <dt>funtzioa:</dt><dd>%1</dd>

source: <dt>location:</dt><dd>%1</dd>
eu: <dt>kokalekua:</dt><dd>%1</dd>

source: <dt>address:</dt><dd>%1</dd>
eu: <dt>helbidea:</dt><dd>%1</dd>

source: <dt>cost:</dt><dd>%1, i.e. %2% of snapshot #%3</dd>
eu: <dt>kostua:</dt><dd>%1, adib. #%3 uneko argazkiaren %%2</dd>

source: <dt>peak cost:</dt><dd>%1</dd>
eu: <dt>kostu gailurra:</dt><dd>%1</dd>

source: below threshold
eu: atalasearen azpitik

source: Function
eu: Funtzioa

source: Location
eu: Kokalekua

source: Peak
eu: Gailurra

source: Snapshots
eu: Uneko argazkia

source: Peak snapshot: heap cost of %1
eu: Gailurraren uneko argazkia: kostua memoria dinamikoan %1

source: Snapshot #%1: heap cost of %2
eu: #%1 uneko argazkia: kostua memoria dinamikoan %2

# %1: snapshot number
source: Snapshot #%1
eu: #%1 uneko argazkia

# %1: cost, %2: snapshot number
source: %1: Snapshot #%2 (peak)
eu: %1: Uneko argazkia #%2 (gailurra)

# %1: cost, %2: snapshot number
source: %1: Snapshot #%2
eu: %1: #%2 uneko argazkia

source: snapshot #%1 (taken at %2%4)\nheap cost: %3
eu: #%1 uneko argazkia (%2%4(e)an ateratakoa) kostua memoria dinamikoan: %3

source: in one place below threshold
eu: leku batean atalasearen azpitik

source: Total Memory Heap Consumption
eu: Memoria pilaren erabilera osoa

source: Snapshot #%1: Heap cost of %2 Extra heap cost of %3 Stack cost of %4
eu: #%1 uneko argazkia: Kostua memoria dinamikoan %2 Kostua gehigarria memoria dinamikoan %3 Kostua pilan %4
